---
kind: type
id: T:Autodesk.Revit.DB.DefinitionBindingMap
source: html/52e2ee94-bcca-9e23-e835-6e9621da6059.htm
---
# Autodesk.Revit.DB.DefinitionBindingMap

A map that contains mappings of parameter definitions to parameter bindings.

## Syntax (C#)
```csharp
public class DefinitionBindingMap : APIObject,
	IEnumerable
```